# Essential Functionality

## droping

In [50]:
import pandas as pd

In [51]:
obj = pd.Series([1,2,3,4,5],index=["a","b","c","d","e"])
obj

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [52]:
new_obj=obj.drop('c')
new_obj

a    1
b    2
d    4
e    5
dtype: int64

In [53]:
obj.drop(['d','c'])

a    1
b    2
e    5
dtype: int64

# dataframe example

In [55]:
import numpy as np
data = pd.DataFrame(np.arange(16).reshape(4,4),
                   index=['one','two','three','four'],
                   columns=['ohio','texas','clorado',"New york"])

In [56]:
data

       ohio  texas  clorado  New york
one       0      1        2         3
two       4      5        6         7
three     8      9       10        11
four     12     13       14        15

In [57]:
data.drop(['one','four'])

       ohio  texas  clorado  New york
two       4      5        6         7
three     8      9       10        11

In [58]:
data.drop(['texas'],axis=1)

       ohio  clorado  New york
one       0        2         3
two       4        6         7
three     8       10        11
four     12       14        15

In [60]:
data.drop(['ohio','clorado'],axis='columns')

       texas  New york
one        1         3
two        5         7
three      9        11
four      13        15

In [61]:
obj

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [62]:
obj.drop('c',inplace=True)

In [63]:
obj

a    1
b    2
d    4
e    5
dtype: int64